---
kind: method
id: M:Autodesk.Revit.DB.ViewShapeBuilder.Reset
source: html/5b1b694c-0977-23cb-1799-1264ffa4a3dd.htm
---
# Autodesk.Revit.DB.ViewShapeBuilder.Reset Method

Clears the accumulated geometry and resets other ViewShapeBuilder parameters to invalid values.

## Syntax (C#)
```csharp
public void Reset()
```